#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu
module.lambda_function.data.aws_partition.current: Reading...
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.s3-bucket.data.aws_region.current: Reading...
module.lambda_function.data.aws_region.current: Reading...
module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3-bucket.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.lambda_function.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.s3-bucket.data.aws_caller_identity.current: Reading...
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.lambda_function.data.aws_caller_identity.current: Reading...
module.s3-bucket.data.aws_partition.current: Reading...
module.s3-bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_function.data.aws_caller_identity.current: Read complete after 0s [id=381491846999]
module.s3-bucket.data.aws_caller_identity.current: Read complete after 0s [id=381491846999]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.aws_iam_policy_document.s3_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_s3_bucket_policy.bucket_policy will be created
  + resource "aws_s3_bucket_policy" "bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_object.static_files["LICENSE.MD"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "22e9a69c0fed5c2558f94d30936ceb4d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "LICENSE.MD"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/LICENSE.MD"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["README.MD"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "944b654035748eacb2c0dfb45306e9d1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "README.MD"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/README.MD"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/css/font-awesome.min.css"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "4083f5d376eb849a458cc790b53ba080"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/css/font-awesome.min.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/css/font-awesome.min.css"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/css/ie9.css"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "470d94a96c3d47932f73742d353617b4"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/css/ie9.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/css/ie9.css"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/css/main.css"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "0ffcbd2725b25c97d49cfa6cee6e0b1b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/css/main.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/css/main.css"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/css/noscript.css"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "7fd97c2561eff6ed6e0ab44775c3cbf1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/css/noscript.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/css/noscript.css"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/fonts/FontAwesome.otf"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/otf"
      + etag                   = "5dc41d8fe329a22fa1ee9225571c843e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/fonts/FontAwesome.otf"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/fonts/FontAwesome.otf"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/fonts/fontawesome-webfont.eot"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/vnd.ms-fontobject"
      + etag                   = "25a32416abee198dd821b0b17a198a8f"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/fonts/fontawesome-webfont.eot"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/fonts/fontawesome-webfont.eot"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/fonts/fontawesome-webfont.svg"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "d7c639084f684d66a1bc66855d193ed8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/fonts/fontawesome-webfont.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/fonts/fontawesome-webfont.svg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/fonts/fontawesome-webfont.ttf"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/ttf"
      + etag                   = "1dc35d25e61d819a9c357074014867ab"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/fonts/fontawesome-webfont.ttf"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/fonts/fontawesome-webfont.ttf"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/fonts/fontawesome-webfont.woff"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/woff"
      + etag                   = "c8ddf1e5e5bf3682bc7bebf30f394148"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/fonts/fontawesome-webfont.woff"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/fonts/fontawesome-webfont.woff"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/fonts/fontawesome-webfont.woff2"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "font/woff2"
      + etag                   = "e6cf7c6ec7c2d6f670ae9d762604cb0b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/fonts/fontawesome-webfont.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/fonts/fontawesome-webfont.woff2"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/js/jquery.min.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "895323ed2f7258af4fae2c738c8aea49"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/js/jquery.min.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/js/jquery.min.js"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/js/main.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "bdf9219b906b8221e289fa893ffb036c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/js/main.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/js/main.js"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/js/skel.min.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "93140e29fa68bab55ce6eae874ae674d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/js/skel.min.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/js/skel.min.js"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/js/util.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "fd2716a7b68ce7748c9676787b61db43"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/js/util.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/js/util.js"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/base/_page.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "18e3dfc719342847411fd9e492dff8ab"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/base/_page.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/base/_page.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/base/_typography.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "efed3ef2c22b4f2a5e72660a03ed8026"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/base/_typography.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/base/_typography.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/components/_box.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "aceb8ac68571fbdf12ff2b25fa11ad79"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/components/_box.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/components/_box.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/components/_button.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "f522a77db993a6ad69de7c5f2e6d7429"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/components/_button.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/components/_button.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/components/_form.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "2a3629d3a2eb1e97a550ce68fb3a5b1a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/components/_form.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/components/_form.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/components/_icon.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "92af6744139ece9e599cd55f0d7aec13"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/components/_icon.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/components/_icon.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/components/_image.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "813ef923aa656ca1853d0beb8c973091"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/components/_image.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/components/_image.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/components/_list.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "a369edc9819354fe050c026d465161cc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/components/_list.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/components/_list.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/components/_table.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "296d5fb794fed32affa2a4878ed8c446"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/components/_table.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/components/_table.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/ie9.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "302e2ba6631dddea4b6aefcb96cea737"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/ie9.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/ie9.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/layout/_bg.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "feb503d1307fe702a765001c06588a36"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/layout/_bg.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/layout/_bg.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/layout/_footer.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "5ca9fcadc7f81bdab646b90325b94da0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/layout/_footer.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/layout/_footer.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/layout/_header.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "e47e86b9e2f84d3965eb30868cb9688a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/layout/_header.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/layout/_header.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/layout/_main.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "e3dc6cd7a9f42fddf397aa43134d4bbf"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/layout/_main.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/layout/_main.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/layout/_wrapper.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d12527837367f945493e32b5c4d99207"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/layout/_wrapper.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/layout/_wrapper.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/libs/_functions.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "bdf24f6877f7521f7e4f191faff7011c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/libs/_functions.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/libs/_functions.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/libs/_mixins.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "9364058c0320aa40bd3debff2f39d1a5"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/libs/_mixins.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/libs/_mixins.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/libs/_skel.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "a7847cc225401e689a4241748201cd33"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/libs/_skel.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/libs/_skel.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/libs/_vars.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "201f32a6be273b5898fd11e814676cff"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/libs/_vars.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/libs/_vars.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/main.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "e73705c1d9fefe07db591b43acb01d77"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/main.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/main.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["assets/sass/noscript.scss"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "3db762631f24735411307e1eadfa0519"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/sass/noscript.scss"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/assets/sass/noscript.scss"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["error/index.html"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html; charset=utf-8"
      + etag                   = "1e6005257a577f310f5539c2a520441e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "error/index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/error/index.html"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["images/bg.jpg"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "336ebad2792632505e3b0037adeeeba2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/bg.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/images/bg.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["images/overlay.png"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "c2d2f4d92c31072bb430e0ed0a609294"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/overlay.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/images/overlay.png"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["images/pic01.jpg"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "55e1797fd15a7113b2be5a8fc1363d93"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/pic01.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/images/pic01.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["images/pic02.jpg"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "4528ad9f4ac47247d0e81d536ab02791"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/pic02.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/images/pic02.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["images/pic03.jpg"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "d537afae25e1f5de2071ec39e6956980"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/pic03.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/images/pic03.jpg"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["index.html"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html; charset=utf-8"
      + etag                   = "ae41b05ee12a79dbf386fadd69279c99"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../static-website-example-master/index.html"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + version_id             = (known after apply)
    }

  # module.cloudfront.aws_cloudfront_distribution.this[0] will be created
  + resource "aws_cloudfront_distribution" "this" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "s3_oac"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "https-only"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = []

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "s3_oac"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac"] will be created
  + resource "aws_cloudfront_origin_access_control" "this" {
      + description                       = "CloudFront access to S3"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "s3_oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.cloudfront.aws_cloudfront_origin_access_identity.this["s3_bucket_one"] will be created
  + resource "aws_cloudfront_origin_access_identity" "this" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "static-site S3 bucket"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/static-site-proxy"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
    }

  # module.lambda_function.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "static-site-proxy-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
    }

  # module.lambda_function.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "static-site-proxy"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.lambda_function.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "static-site-proxy"
    }

  # module.lambda_function.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Proxy the contents of an S3 bucket with https."
      + filename                       = "../app/lambda_proxy.zip"
      + function_name                  = "static-site-proxy"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }
    }

  # module.lambda_function.aws_lambda_function_url.this[0] will be created
  + resource "aws_lambda_function_url" "this" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "static-site-proxy"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)
    }

  # module.s3-bucket.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "static-site-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Owner"     = "clerk-app"
          + "Terraform" = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3-bucket.aws_s3_bucket_ownership_controls.this[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.s3-bucket.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 57 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + function_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/artifacts/plan-output.txt

To perform exactly these actions, run the following command to apply:
    tofu apply "/tmp/artifacts/plan-output.txt"

```

</details>

*Pusher: @johnf-staybull, Action: `pull_request`, Working Directory: ``, Workflow: `opentofu-setup`*